extends Node

var lines: Array = [

	# Scene 1
	{"bg":"res://sprites/scene/scene_1_inspector_office.png", "sprite":"tana_chill.png", "name":"???", "text":"นั่งลงสิ", "sfx":"ceiling_fan.mp3", "bgm":"null"},
	{"name":"เมฆ", "text":"ครับ"},
	{"name":"???", "text":"อืม…"},
	{"name":"???", "text":"เมฆินทร์ นฤพานิช เป็นนักสืบเอกชน รับงานฟรีแลนซ์ใช่มั้ย"},
	{"name":"เมฆ", "text":"ใช่ครับ"},
	{"name":"สารวัตรธนา", "text":"อืม ผมชื่อธนานะ ทางกรมฯ ต้องจ้างคนมารับงานนี้เพิ่ม เพราะขาดคนน่ะ"},

	{"name":"", "text":"(เสียงเคาะประตู)"},
	{"name":"เมฆ", "thought":true, "text":"หืม ใครน่ะ"},
	{"name":"สารวัตรธนา", "text":"เข้ามาได้ ประตูไม่ได้ล็อค"},

	{"sprite":"fon_upset.png", "name":"???", "text":"พ่ออดข้าวเย็นอีกแล้วใช่มั้ยคะ"},
	{"name":"เมฆ", "thought":true, "text":"ล-ลูกสาวของสารวัตรเหรอ เข้ามาถามเรื่องข้าวเย็นซะงั้น"},

	{"sprite":"tana_chill.png", "name":"สารวัตรธนา", "text":"ไว้ก่อนลูก"},
	{"name":"สารวัตรธนา", "text":"ขอโทษเรื่องลูกสาวผมด้วยนะ"},

	{"bg":"res://sprites/characters/pete/pete.png", "name":"สารวัตรธนา", "text":"ผู้เคราะห์ร้ายชื่อ “พีท” อายุ 21 ปี ศึกษาอยู่ที่มหาลัยแจ่มจันทร์ เป็นนักศึกษาปี 2"},
	{"name":"สารวัตรธนา", "text":"หายตัวไป 3 วัน ติดต่อไม่ได้ตั้งแต่วันแรกที่หายตัวไป"},

	{"bg":"res://sprites/scene/scene_1_inspector_office.png", "sprite":"tana_chill.png", "name":"เมฆ", "text":"มีพยานบุคคลในวันสุดท้ายที่เจอน้องพีทมั้ยครับ"},
	{"name":"สารวัตรธนา", "text":"เท่าที่ลูกน้องผมตรวจสอบ มีเพื่อนคนนึงที่ทำโปรเจกต์กลุ่มด้วยกัน กับ เพื่อนอีกคนที่อยู่ชมรมเดียวกัน"},
	{"name":"สารวัตรธนา", "text":"แต่… คำให้การของ 2 คนนี้ ไม่ตรงกัน คนนึงบอกเห็นพีทแถวตึกสำนักทะเบียน อีกคนบอกว่าพีทกลับหอไปแล้ว"},
	{"name":"เมฆ", "text":"แล้วมีภาพจากกล้องวงจรปิดมั้ยครับ"},
	{"name":"สารวัตรธนา", "text":"มีแค่ภาพบางส่วน เขายังไม่ได้เปิดเผยให้ตำรวจทั้งหมด ต้องรอทางมหาลัยอนุมัติ"},

	{"sprite":"fon_curious.png", "name":"???", "text":"งั้นลองไปถามคนอื่นที่มหาลัยดูมั้ยคะ"},
	{"sprite":"tana_chill.png", "name":"สารวัตรธนา", "text":"ไปถามก็ได้อยู่หรอก แต่ทางมหาลัย.. ชอบกังวลเรื่องภาพลักษณ์น่ะสิ"},
	{"name":"เมฆ", "text":"ท่านหมายถึงว่า มหาลัยต้องการให้ปิดเรื่องคดีเป็นความลับเหรอครับ"},
	{"name":"สารวัตรธนา", "text":"เท่าที่ผมเจอมา บางคดีก็เงียบหาย เพราะคนบางกลุ่ม.. กลัวเสียชื่อเสียง"},

	{"sprite":"fon_curious.png", "name":"???", "text":"พ่อพูดเหมือนกับ-"},
	{"sprite":"tana_serious.png", "name":"สารวัตรธนา", "text":"ฝน.. อย่าเดาสุ่มสี่สุ่มห้า"},
	{"name":"เมฆ", "thought":true, "text":"เหมือนว่า.. จะมีเบื้องหลังที่เราไม่ควรรู้สินะ.."},

	{"sprite":"tana_chill.png", "name":"สารวัตรธนา", "text":"งั้นคุณเมฆินทร์ ก็ลงพื้นที่สืบสวนด้วยตัวเองก่อนละกันนะ ถ้าจะเข้าพื้นที่ที่ปิดทำการอยู่ ก็โทรมาถามผมก่อนว่าเขาอนุญาตมั้ย"},
	{"name":"เมฆ", "text":"ครับผม"},
	{"sprite":"fon_curious.png", "name":"ฝน", "text":"แล้วถ้าความจริง.. มันอยู่ในที่ที่มหาลัยไม่ให้เข้าล่ะ…"},
	{"sprite":"tana_chill.png", "name":"สารวัตรธนา", "text":"…"},
	{"name":"สารวัตรธนา", "text":"ไว้เจอกัน คุณเมฆินทร์ มีอะไรติดต่อผมได้", "sfx":"null"},

	# Scene 2
	{"bg":"res://sprites/scene/scene_2_guard_house.png", "sprite":"", "name":"เมฆ", "thought":true, "text":"อืม.. ที่นี่สินะ มหาลัยแจ่มจันทร์", "sfx":"light_rain.mp3", "bgm":"null"},
	{"name":"เมฆ", "thought":true, "text":"ไม่เคยมาเลยแฮะ แต่พอมาถึงแล้ว รู้สึก.. วังเวงแปลกๆ"},

	{"sprite":"fon_smile_with_umbrella.png", "name":"ฝน", "text":"สวัสดีค่าา"},
	{"name":"เมฆ", "text":"!?"},
	{"name":"เมฆ", "text":"ดึกป่านนี้ คุณฝนมีธุระอะไรที่มหาลัยเหรอครับ"},
	{"name":"ฝน", "text":"เรียกหนู น้องฝน ก็ได้ค่ะ พี่เมฆินทร์ชื่อเล่นอะไรเหรอคะ"},
	{"name":"เมฆ", "text":"พี่ชื่อเมฆครับ"},
	{"name":"ฝน", "text":"ค่ะ หนูอ่ะ ต้องถามพี่เมฆว่า มายืนตากฝนหน้าป้อมยามทำไมคะ"},
	{"name":"เมฆ", "text":".."},
	{"name":"เมฆ", "text":"พี่กำลังคิดอยู่ว่าจะเริ่มดูจากตรงไหนก่อนดี เพื่อให้การสืบคดีเป็นความลับ พี่เลยมาดึกน่ะ"},

	{"sprite":"fon_curious_with_umbrella.png", "name":"ฝน", "text":"หนูเอง.. ก็คาใจเหมือนกันค่ะ เลยอยากมาสืบ พอดีว่าหนูก็เรียนที่นี่เหมือนกัน"},
	{"name":"เมฆ", "text":"อ้าวเหรอ พี่เพิ่งรู้ แล้ว.. สารวัตรธนาไม่ว่าเหรอ ถ้าน้องฝนมาเวลานี้"},
	{"name":"ฝน", "text":"…"},
	{"sprite":"fon_smile_with_umbrella.png", "name":"ฝน", "text":"พี่เมฆจะเข้าไปดูใช่มั้ยคะ หนูไปด้วยได้มั้ย"},

	{"type":"choice", "choices":[
		{"label":"A) ได้สิ ช่วยบอกทางหน่อย", "say":"เอาสิ เดี๋ยวช่วยบอกทางพี่หน่อยนะ พี่เพิ่งเคยมา", "effects":{"CHA":1}, "next":"after_choice_ab"},
		{"label":"B) ได้สิ อย่าซนมากนะ", "say":"ก็ได้ แต่อย่าเที่ยวซนนะ เผื่อเจอเบาะแสที่เป็นหลักฐานเพิ่มเติมได้", "effects":{"INT":1}, "next":"after_choice_ab"},
		{"label":"C) ขออนุญาตสารวัตรก่อน", "say":"ถ้าน้องฝนยังไม่ได้บอกพ่อ เดี๋ยวพี่ต้องโทรถามก่อนนะ", "effects":{}, "next":"after_choice_c"}
	]},

	{"id":"after_choice_ab", "name":"ฝน", "text":"งั้นไปกันเถอะค่ะ", "skip_to":"after_choice_end"},
	{"id":"after_choice_c", "name":"ฝน", "text":"เดี๋ยวหนูค่อยบอกเขาทีหลังก็ได้ ไปกันเถอะค่ะ", "skip_to":"after_choice_end", "sfx":"null"},

	# Scene 3
	{"id":"after_choice_end", "bg":"res://sprites/scene/scene_3_lonely_path.png", "sprite":"", "name":"เมฆ", "text":"(เข้ามาทางประตูเล็กแบบนี้ได้เลยเหรอ..)", "sfx":"light_rain2.mp3", "bgm":"atmospheric_piano.mp3"},
	{"sprite":"fon_smile.png", "name":"ฝน", "text":"เหมือนว่าฝนจะซาลงแล้วนะคะ"},
	{"name":"เมฆ", "text":"แต่ยังมีฝนแถวนี้ ไม่ซาเลยนะ ดีดตลอด"},
	{"sprite":"fon_curious.png", "name":"ฝน", "text":"??"},
	{"name":"เมฆ", "text":"ป-ไปกันต่อเถอะ"},
	{"name":"ฝน", "text":".."},
	{"name":"ฝน", "text":"ตรงนี้ปกติไม่ค่อยมีคนมาเลยค่ะ กลางวันก็ยังร้างเลย"},

	{"name":"", "text":"(ได้ยินเสียงกรอบแกรบจากใบไม้แห้ง)", "sfx":"dried_leaves.mp3", "bgm":"null"},
	{"sprite":"fon_shocked.png", "name":"ฝน", "text":"เมื่อกี๊.. ได้ยินเสียงมั้ยคะ"},
	{"name":"เมฆ", "text":"หืม ก็ได้ยินนะ"},
	{"name":"เมฆ", "text":"น่าจะเสียง.. ลมพัดใบไม้รึเปล่า"},
	{"name":"เมฆ", "thought":true, "text":"แต่คิดๆ ดู มันก็.. ดังเหมือนกันนะ เสียงเมื่อกี๊"},
	{"name":"ฝน", "text":".."},
	{"name":"ฝน", "text":"ค่ะ.."},

	{"name":"", "text":"", "sfx":"light_rain2.mp3", "bgm":"atmospheric_piano.mp3"},

	{"sprite":"fon_curious.png", "name":"ฝน", "text":"พี่เมฆคิดว่า ทำไมพีทถึงหายตัวไปเหรอคะ"},
	{"name":"เมฆ", "text":"พี่ก็ยังสันนิษฐานอะไรไม่ได้หรอก แต่ถ้ามีใครพยายามปกปิดข้อมูลบางส่วน แปลว่าอาจจะมีเรื่องที่ไม่อยากให้ใครรู้ก็ได้นะ"},
	{"name":"ฝน", "text":"หมายถึง.. ภาพจากกล้องวงจรปิดบางส่วนที่คุณพ่อไม่มีสินะคะ"},
	{"name":"เมฆ", "text":"อืม แต่พี่อาจจะแค่กังวลกับเรื่องไม่เป็นเรื่องก็ได้"},
	{"name":"ฝน", "text":"ไม่หรอกค่ะ.. หนูก็คิดแบบนั้นเหมือนกัน"},
	{"name":"ฝน", "text":"ถึงแล้วค่ะ ตึกสำนักทะเบียน"},

	# Scene 4
	{"bg":"res://sprites/scene/scene_4_registration_office.png", "sprite":"fon_curious.png", "name":"ฝน", "text":"ประตูหน้าตึกน่าจะล็อคอยู่", "sfx":"light_rain2.mp3", "bgm":"mysterious_piano.mp3"},
	{"name":"ฝน", "text":"อืม.. ปกติจะมีพี่ยาม ประจำอยู่ที่ป้อมนี้ แต่วันนี้เหมือนพี่เขาจะไม่อยู่ค่ะ"},
	{"name":"เมฆ", "thought":true, "text":"ยามที่ประจำอยู่ตรงนี้ไม่อยู่.. เขาไปทำธุระอะไรรึเปล่านะ"},
	{"name":"เมฆ", "text":"เราจะมาดูเรื่องภาพจากกล้องวงจรปิดของตึกนี้เลยใช่มั้ย แล้วจะเข้าไปยังไงล่ะ ถ้ายามไม่อยู่"},
	{"sprite":"fon_smile.png", "name":"ฝน", "text":"มี.. ทางเข้าลับค่ะ"},
	{"name":"ฝน", "text":"ถ้าเดินเลาะไปทางด้านหลังของตึก จะมีประตูบานนึง.. ไม่ได้ล็อคค่ะ ลูกบิดมันเสีย"},
	{"name":"เมฆ", "text":".."},
	{"name":"เมฆ", "text":"พี่จะไม่ถามฝนละกันนะ ว่ารู้ได้ไง"},
	{"name":"เมฆ", "text":"งั้นพวกเราเข้าไปก่อน แล้วถ้าเจอยามคนนั้น ค่อยบอกเขาละกันนะว่าเรามาสืบคดี"},
	{"name":"ฝน", "text":"ค่า ไปกันเถอะ"},

	# Scene 5
	{"bg":"res://sprites/scene/scene_5_office_1st_floor.png", "sprite":"fon_curious.png", "name":"ฝน", "text":"เราน่าจะไปเช็คเรื่องกล้องวงจรปิดของตึกนี้กันนี่แหละค่ะ เพราะพบเห็นพีทครั้งสุดท้ายแถวนี้"},
	{"name":"เมฆ", "text":"ใช่ แล้วเรารู้เหรอว่า เขาเก็บข้อมูลภาพถ่ายกันที่ไหน"},
	{"name":"ฝน", "text":"หนูไม่มั่นใจนะ แต่ปกติก็น่าจะเก็บไว้ที่ห้องเก็บเอกสารค่ะ อยู่ชั้น 2"},
	{"name":"เมฆ", "text":"อืม.. แล้วห้องไม่ได้ล็อคเหรอ"},
	{"sprite":"fon_smile.png", "name":"ฝน", "text":"หนูมีวิธีค่ะ"},
	{"name":"เมฆ", "text":".."},
	{"name":"เมฆ", "text":"ฝนเป็นนักศึกษาจริงๆ ใช่มั้ยเนี่ย"},
	{"name":"เมฆ", "text":"เดี๋ยวเราค่อยบอกกับยามคนนั้นทีหลังละกันนะว่าเรามาทำอะไร"},

	# Scene 6
	{"bg":"res://sprites/scene/scene_6_office_2nd_floor.png", "sprite":"fon_curious.png", "name":"เมฆ", "text":".."},
	{"name":"เมฆ", "text":"ก่อนหน้านี้ ฝนรู้จักพีทรึเปล่า"},
	{"name":"ฝน", "text":"อืม.. ตอนแรกหนูก็จำเขาไม่ได้ แต่พอเห็นหน้าก็นึกออกนะคะ เคยคุยกันครั้งนึง ทักทายกันปกติ"},
	{"name":"ฝน", "text":"แต่เวลาคุยเขาดูเหมือนกลัวหรือระแวงอะไรสักอย่าง"},
	{"name":"เมฆ", "text":"กลัวเหรอ"},
	{"name":"ฝน", "text":"ค่ะ ท่าทางกลัว มองซ้ายมองขวาตลอด เหมือนกับว่ามีปัญหาสักอย่างนึง"},

	{"name":"", "text":"(เสียงกล่องเอกสารหล่นจากในห้องไกลๆ)", "sfx":"box_fall.mp3", "bgm":"null"},
	{"sprite":"fon_shocked.png", "name":"ฝน", "text":"!?"},
	{"name":"เมฆ", "text":"!?"},
	{"name":"เมฆ", "text":"เสียง.. จากห้องนั้น !"},
	{"name":"ฝน", "text":"ห้องนี้มัน.."},

	# Scene 7
	{"bg":"res://sprites/scene/scene_7_front_file_room.png", "sprite":"fon_shocked.png", "name":"ฝน", "text":"ห้องเก็บเอกสารค่ะ", "sfx":"light_rain2.mp3", "bgm":"null"},
	{"name":"เมฆ", "thought":true, "text":"เสียงเหมือนมีคนอยู่ข้างใน แปลว่า มีคนอื่นนอกจากพวกเราด้วยเหรอ"},
	{"name":"เมฆ", "thought":true, "text":"ดึกป่านนี้เนี่ยนะ"},

	{"type":"choice", "choices":[
		{"label":"A) โทรแจ้งสารวัตรธนา", "say":"แบบนี้เข้าข่ายผิดปกติแล้วล่ะ พี่ต้องแจ้งพ่อเราก่อน", "effects":{}, "next":"scene7_call"},
		{"label":"B) เดี๋ยวพี่เข้าไปดูเอง ฝนรอข้างนอก", "say":"ฝนเปิดประตูให้พี่ แล้วเดี๋ยวพี่เข้าไปดูเอง ฝนรออยู่ข้างนอกนี่นะ", "effects":{"CHA":1}, "next":"scene7_open"},
		{"label":"C) รีบเปิดเข้าไปดู", "say":"ฝนรีบเปิดประตูเร็ว เราจะไปเข้าดูว่าใครอยู่ในห้องกันแน่", "effects":{"INT":1}, "next":"scene7_open"}
	]},

	{"id":"scene7_call", "sprite":"fon_upset.png", "name":"ฝน", "text":"…", "sfx":"phone_call.mp3", "bgm":"null"},
	{"name":"เมฆ", "thought":true, "text":"รีบรับสายเร็วเข้า สารวัตรรร"},
	{"name":"", "text":"", "sfx":"box_fall.mp3"},
	{"sprite":"fon_shocked.png", "name":"ฝน", "text":"!?"},
	{"name":"ฝน", "text":"มีคนอยู่จริงๆ ค่ะ หนูจะรีบเปิดประตูก่อน", "skip_to":"scene7_open"},

	{"id":"scene7_open", "sprite":"fon_shocked.png", "name":"ฝน", "text":"ค-ค่ะ"},
	{"name":"", "text":"", "sfx":"lockpick.mp3"},
	{"name":"", "text":"", "sfx":"door_open.mp3"},
	{"name":"", "text":"", "sfx":"box_fall.mp3", "skip_to":"scene8_start"},

	# Scene 8
	{"id":"scene8_start", "bg":"res://sprites/scene/scene_8_file_room_light_on.png", "sprite":"guard/silhouette.png", "name":"เมฆ", "text":"เห้ย คุณเป็นใคร เข้ามาได้ไง มาขโมยของเหรอ!?", "sfx":"null", "bgm":"suspense.mp3"},
	{"name":"???", "text":"!?"},
	{"name":"", "text":"", "sfx":"light_switch.mp3", "skip_to":"scene9_start"},

	# Scene 9
	{"id":"scene9_start", "bg":"res://sprites/scene/scene_9_file_room_light_off.png", "sprite":"", "name":"", "text":"", "sfx":"light_rain2.mp3", "bgm":"null"},
	{"name":"", "text":"", "sfx":"jump.mp3"},
	{"name":"เมฆ", "thought":true, "text":"ม-ไม่เห็นเลย"},
	{"name":"เมฆ", "thought":true, "text":"ต้องรีบเปิดไฟก่อน"},
	{"name":"เมฆ", "thought":true, "text":"จ-เจอสวิตช์แล้ว!"},
	{"name":"", "text":"", "sfx":"light_switch.mp3", "skip_to":"scene10_start"},

	# Scene 10
	{"id":"scene10_start", "bg":"res://sprites/scene/scene_10_file_room_window_open.png", "sprite":"fon_shocked.png", "name":"ฝน", "text":"ก-กระโดดออกนอกหน้าต่างไปแล้วค่ะ..", "sfx":"light_rain2.mp3", "bgm":"atmospheric_piano.mp3"},
	{"name":"เมฆ", "text":"ใครกันแน่นะ.."},
	{"name":"เมฆ", "text":"!?"},
	{"name":"เมฆ", "text":"คอมพิวเตอร์เปิดอยู่", "skip_to":"scene11_start"},

	# Scene 11
	{"id":"scene11_start", "bg":"res://sprites/scene/scene_11_pc_monitor.png", "sprite":"", "name":"เมฆ", "text":"นี่มัน..", "sfx":"null", "bgm":"null"},
	{"name":"ฝน", "text":"ค่ะ.."},
	{"name":"ฝน", "text":"เป็นพีทแน่นอนค่ะ"},
	{"name":"เมฆ", "text":"อืม เหมือนว่า.."},

	{"bg":"res://sprites/scene/scene_11_cctv_photo_1.png", "sprite":"", "name":"เมฆ", "text":"ภาพซ้ายมือนี่คือ.. พีทออกมาจากพุ่มไม้"},
	{"bg":"res://sprites/scene/scene_11_cctv_photo_2.png", "sprite":"", "name":"เมฆ", "text":"แล้วภาพขวามือคือ.. เหมือนกำลังรีบเดินออกไป.."},
	{"bg":"res://sprites/scene/scene_11_pc_monitor.png", "sprite":"", "name":"เมฆ", "text":"เท่ากับว่า คนเมื่อกี๊มาเปิดดูรูปพวกนี้สินะ"},

	{"bg":"res://sprites/scene/scene_11_cctv_photo_1.png", "sprite":"", "name":"ฝน", "text":"ดูจากมุม เหมือนว่าพุ่มไม้นี่ น่าจะอยู่ตรงหน้าตึกนี้นะคะ"},
	{"name":"เมฆ", "text":"..", "skip_to":"scene12_start"},

	# Scene 12
	{"id":"scene12_start", "bg":"res://sprites/scene/scene_12_file_room_window_open.png", "sprite":"fon_curious.png", "name":"เมฆ", "text":"ทั้งผู้ต้องสงสัยคนเมื่อกี๊ แล้วก็รูปภาพ 2 รูปนี้อีก..", "sfx":"light_rain2.mp3", "bgm":"null"},
	{"name":"เมฆ", "thought":true, "text":"โธ่เว้ย.. มืดแปดด้านไปหมด"},
	{"sprite":"fon_upset.png", "name":"เมฆ", "text":"เรามาเก็บเอกสารพวกนี้กันก่อนเถอะ"},

	# Scene 13
	{"bg":"res://sprites/scene/scene_13_file_room_cleaned.png", "sprite":"fon_upset.png", "name":"เมฆ", "text":"ตอนนี้คงต้องเก็บห้องนี้เป็นพยานหลักฐานแล้วล่ะ", "sfx":"light_rain2.mp3", "bgm":"null"},
	{"name":"เมฆ", "text":"คืนนี้.. คงต้องพอเท่านี้ก่อน"},
	{"name":"ฝน", "text":"พี่เมฆ แต่หนูว่า-"},
	{"name":"เมฆ", "text":"ฝนอยากจะตามโจรนั่นไปเหรอ!?"},
	{"sprite":"fon_shocked.png", "name":"เมฆ", "text":"มัน.. ไม่มีประโยชน์หรอก"},
	{"name":"เมฆ", "text":"ต่อให้เมื่อกี๊จับมันได้.. ยังไงสุดท้ายก็ต้องปล่อยตัวไป"},
	{"name":"เมฆ", "text":"เพราะเราก็แอบเข้ามา โดยไม่ได้ขออนุญาตใคร"},
	{"name":"เมฆ", "text":"ใช้อำนาจตำรวจไม่ได้หรอก"},
	{"name":"ฝน", "text":"ต-แต่อย่างน้อยเราก็จะได้รู้ว่าเป็นใครนะคะ!"},
	{"name":"เมฆ", "text":"พี่จะปล่อยให้ลูกสาวสารวัตร มาเสี่ยงกับคดีแบบนี้ไม่ได้หรอกนะ"},
	{"sprite":"fon_upset.png", "name":"เมฆ", "text":"เดี๋ยวพี่จะพาฝนไปหาพ่อ"},
	{"name":"เมฆ", "text":"กลับบ้าน.. ไปพักผ่อนเถอะนะ"},
	{"name":"ฝน", "text":"…"},
	{"name":"ฝน", "text":"ค่ะ.."},
	
	# End Chapter 1
]
